<!DOCTYPE html>
<html lang="es">
    <head>
        <title>Laboratorio de programación web</title>
        <link href="https://fonts.googleapis.com/css?family=Roboto&display=swap" rel="stylesheet">
        <link rel="stylesheet" href="style.css" media="all">
        <meta charset="utf-8">
    </head>

    <body>
        <nav>
            <ul id="pr">
                <a href="index.html">
                    <li>Inicio</li>
                </a>
                <a href="practica1.html">
                    <li>Práctica #1</li>
                </a>
                <a href="practica2.html">
                    <li>Práctica #2</li>
                </a>
                <a href="practica3.html">
                    <li>Práctica #3</li>
                </a>
                <a href="practica4.html">
                    <li>Práctica #4</li>
                </a>
                <a href="practica5.html">
                    <li>Práctica #5</li>
                </a>
                <a href="practica6.html">
                    <li>Práctica #6</li>
                </a>
                <a href="practica7.html"><li>Práctica #7</li></a>
                <a href="testimonios.html"><li>Testimonios</li></a>
            </ul>
        </nav>

        <h1 id="equipo-header">Equipo #15</h1>

        <main>
            <h3 id="iquestqueacuteescss">&iquest;Qu&eacute; es CSS?</h3>

            <p>CSS (en ingl&eacute;s Cascading Style Sheets) es lo que se denomina lenguaje de hojas de estilo en cascada y se usa para estilizar elementos escritos en un lenguaje de marcado como HTML. CSS separa el contenido de la representaci&oacute;n visual del sitio.
            CSS fue desarrollado por W3C (World Wide Web Consortium) en 1996 por una raz&oacute;n muy sencilla. HTML no fue dise&ntilde;ado para tener etiquetas que ayuden a formatear la p&aacute;gina. Est&aacute; hecho solo para escribir el marcado para el sitio.
            La relaci&oacute;n entre HTML y CSS es muy fuerte. Dado que HTML es un lenguaje de marcado (es decir, constituye la base de un sitio) y CSS enfatiza el estilo (toda la parte est&eacute;tica de un sitio web), van de la mano.</p>

            <h3 id="iquestparaqueacutesirvecss">&iquest;Para qu&eacute; sirve CSS?</h3>

            <p>CSS es un lenguaje utilizado en la presentaci&oacute;n de documentos HTML. Un documento HTML viene siendo coloquialmente &ldquo;una p&aacute;gina web&rdquo;. Entonces podemos decir que el lenguaje CSS sirve para organizar la presentaci&oacute;n y aspecto de una p&aacute;gina web. Este lenguaje es principalmente utilizado por parte de los navegadores web de internet y por los programadores web inform&aacute;ticos para elegir multitud de opciones de presentaci&oacute;n como colores, tipos y tama&ntilde;os de letra, etc.</p>

            <h3 id="iquestcuaacutelesladiferenciaqueseriacuteamaacutesdifiacutecilderealizarenunsitiowebsiseoptarapornousaruncss">&iquest;Cu&aacute;l es la diferencia que ser&iacute;a m&aacute;s dif&iacute;cil de realizar en un sitio web si se optara por no usar un CSS?</h3>

            <p>CSS permite dar una estructura a la p&aacute;gina web para que sea f&aacute;cil de navegar. Mientras que los colores no afectan a la funcionalidad, una p&aacute;gina sin una buena estructura de dise&ntilde;o y que posicione los elementos de manera correcta ser&iacute;a casi imposible de utilizar. Si se opta por no usar CSS, la l&oacute;gica para manejar los tama&ntilde;os y posiciones de los elementos deber&iacute;a ser codificada en JavaScript y aumentar&iacute;a la complejidad del c&oacute;digo.</p>

            <p>Algunas opciones b&aacute;sicas del lenguaje CSS por ejemplo pueden ser el poder cambiar el color de algunas t&iacute;picas etiquetas HTML como &lt;H1&gt;; pero tambi&eacute;n hay funciones algo m&aacute;s complejas, como introducir espaciado entre elementos &lt;DIV&gt;
            CSS es muy intuitivo y sencillo una vez se llega a aprender, ya que te puedes apoyar en el uso de los identificadores de etiqueta HTML, luego indicamos con qu&eacute; aspecto queremos que se muestren todas las etiquetas, y listo.
            Para crear el archivo basta abrir un editor de texto como el bloc de notas escribir el texto y guardar el archivo con el nombre adecuado.</p>

            <h3 id="resetcss">Reset CSS</h3>

            <p>Todos los elementos de HTML tienen estilos por defecto dependiendo del navegador, pero gracias a CSS se le puede cambiar cualquier tipo de cosa a la pagina, el tama&ntilde;o de la letra, la fuente, los margenes, etc., y hay una tecnica para poder eliminar todos los estilos por defecto a los elementos HTML, lo que setiene que hacer es agregarle en la cabeza del HTML un CSS el cual tenga de nombre &uml;reset.css&uml; creando asi una hoja la cual prefija los margenes, las distancias a 0.</p>

            <h3 id="historiadelasteacutecnicasdepresentacioacutenenpantallaparalaweb">Historia de las T&eacute;cnicas de presentaci&oacute;n en pantalla para la Web</h3>

            <p>Se empez&oacute; a dar dise&ntilde;o a las webs a mediado de los 90 el &uacute;nico m&eacute;todo que se pod&iacute;a usar para crear estructuras visuales complejas era usar el elemento tabla (&lt;table&gt;), a partir de esto se empez&oacute; a usar t&eacute;cnicas como anidamiento de tablas en la cual juntaban varias tablas as&iacute; creando varios espacios en los cuales pon&iacute;an informaci&oacute;n, fotos, etc, ah&iacute; dentro, dando as&iacute; un estilo visual &uacute;nico en ese tiempo.</p>

            <h3 id="distintasopcionesdepresentacioacutendepaacuteginas">Distintas opciones de presentaci&oacute;n de p&aacute;ginas</h3>

            <p>Al momento de crear la estructura visual de la pagina se tienen que saber varias cosas, por ejemplo, la anchura de esta, hay dos categor&iacute;as principales de 
            estructura en base a la anchura las cuales son: las de anchura fija y las de ancho variable.</p>

            <p>En las estructuras de ancho fijo como su nombre lo dice se mantiene dentro del ancho que se le especifico, se le puede poner el valor en pixels pero com&uacute;nmente
            la unidad que se usa es em, esta estructura es c&oacute;moda para el dise&ntilde;ador ya que le deja poner todas las cosas precisamente donde las quiere (cabecera, barras 
            laterales, pies de paginas, etc), incluso da un esqueleto firme para otros elementos como la anchura de los p&aacute;rrafos, el posicionamiento de las im&aacute;genes, etc.</p>

            <p>Del otro lado tenemos las estructuras flexibles las cuales son hechas para adaptarse a la anchura de la ventana del navegador en cualquier momento, estas  estructuras son mas recomendables que las fijas ya que hoy en d&iacute;a hay muchas pantallas de diferentes tama&ntilde;os y no tan solo es lapota y computadoras, ahora hay gran uso de celulares, tabletas,  etc., por lo cual son muy adecuadas debido a que permiten re posicionar los textos e im&aacute;genes para mayor comidan del usuario, pero tienen su desventaja la cual es que son mas dif&iacute;ciles de dise&ntilde;ar.  </p>

            <h3 id="elelementoltdivgt">El elemento &lt;div&gt;</h3>

            <p>Se le puede considerar al elemento &lt;div&gt; como un contenido gen&eacute;rico en el que se pueden poner elementos que se relacionen entre si de forma l&oacute;gica.
            Los elementos &lt;div&gt; suelen tener un ID o una pertenecer a una clase para asi poder darle estilos CSS, esto facilita el identifica las diferentes 
            secciones de la pagina y poder aplicar el estilo que queramos ah&iacute;.</p>

            <h3 id="lapropiedadfloatcss">La propiedad float CSS</h3>

            <p>Esta propiedad permite que se puede escribir alrededor de una imagen, ya que cambia la posici&oacute;n relativa con respecto al elemento flotante. 
            En los elementos float se le pueden dar valores &uml;left&uml;, &uml;right&uml;y &uml;none&uml; para dirigir en donde se pondr&iacute;a el texto.
            Se pueden colocar varios elementos flotantes dentro del mismo contenedor haciendo que todos se alinean.</p>

            <h3 id="lapropiedadclear">La propiedad clear</h3>

            <p>Esta propiedad hace que no haya elementos flotantes en los lados del objeto, se le puede especificar que no se ponga en la izquierda, en la
            derecha o en los dos lados.</p>

            <h3 id="conclusiones">Conclusiones:</h3>

            <p>Ulises Baltazar Garza Garc&iacute;a: CSS al igual que HTML lleva su historia y ambos han sabido complementarse el uno con el otro haciendo las veces de la estructura de las p&aacute;ginas web de una manera sencilla y f&aacute;cil de aprender para todo tipo de p&uacute;blico adem&aacute;s de ser f&aacute;cil de exceder con cualquier editor de texto logrando que cualquier persona pueda usar y crear su p&aacute;gina webs.</p>

            <p>Emilio Gonz&aacute;lez Rodr&iacute;guez: CSS es la base fundamental, junto con HTML y JavaScript de la web que conocemos. Aunque parezca ser menos importante que HTML y JavaScript, lo cierto es que, sin CSS la funcionalidad y dise&ntilde;o que atrajeron a la mayor&iacute;a de usiarios no estar&iacute;an navegando la web. CSS ha permitido que millones de p&aacute;ginas web logren verse modernas y ofrezcan una mejor experiencia de usuario. Sin duda, CSS ha aprendido de su historia y contin&uacute;a mejorando.</p>

            <p>Jorge Rivera Gomez: Aprend&iacute; que CSS fue creado para trabajar en conjunto con lenguajes de marcado como HTML. Se utiliza para darle estilo a una p&aacute;gina. Hay tres estilos de implementaci&oacute;n de CSS, y puedes usar el estilo Externo para asignar varias p&aacute;ginas a la vez. Hoy en d&iacute;a podr&aacute;s ver alg&uacute;n tipo de implementaci&oacute;n de CSS en cualquier parte, ya que es un requisito tan importante como el propio lenguaje de marcado.</p>

            <p>Ra&uacute;l Alejandro Castillo Medina: Para mi en lo personal esta practica, relacionada con css me pareci&oacute; muy interesante, ya que as&iacute; aprend&iacute; sobre esta herramienta que a mi parecer me parece esencial a la hora de programar en html, ya sea desde darle un toque mas personal en dise&ntilde;o a mi pagina, hasta evitar poner tanto c&oacute;digo en el archivo fuente para lo mismo que sea mas legible para otros programadores, si en todo caso fuera un c&oacute;digo libre que pudiera subir a la red, me es mucho mas c&oacute;modo, programarlo por fuera como un archivo adjunto al html original, mandarlo llamar y que realice su objetivo, algo parecido a las funciones que nos ofrece javascript que me imagino veremos mas adelante.</p>

            <p>Juan Pablo Amaya Garc&iacute;a: CSS es una herramienta de suma importancia para HTML ya que le permite tener un estilo &uacute;nico, representativo y atractivo a la p&aacute;gina, permite acomodar fotos, texto, lo que sea como queramos para mostrar lo mejor a los usuarios.</p>
        </main>

    </body>

</html>
